app/views/players/index.html.erb

SELECT "players".* FROM "players"
---
          <% if s.row == 1 %>
            <%= button_to "Move", players_move_path(:column => s.column, difficulty: Player::DIFFICULTIES[0]), disabled: @winning_player_name.present?, class: @difficulty=="easy" ? "easy_move_button display-inline" : "easy_move_button display-none" %>